In [1]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')

In [2]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
ufo.shape

(18241, 5)

In [4]:
ufo.drop('Colors Reported', axis=1, inplace = True)#here axis = 1 is the column axis
#and axis = 0 is the row axis

In [5]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [6]:
#Scenario 2: Dropping multiple columns at once
#instead of passing in a string, pass in list
ufo.drop(['City', 'State'], axis = 1, inplace = True)

In [7]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [8]:
#Scenario 3:
#i want to drop row axis
#here index are the names of the rows
#previous, the name of the columns were given
ufo.drop([0 , 1, axis = 0, inplace = True)

TypeError: drop() got multiple values for argument 'axis'